tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "randomplum/gtkwave"
tap "rylan12/personal"
tap "teamookla/speedtest"
brew "actionlint"
brew "archey4"
brew "aria2"
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "gnupg"
brew "htop"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "less"
brew "neovim"
brew "nodenv"
brew "pinentry-mac"
brew "pure"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "vale"
brew "watch"
brew "wget"
brew "wifi-password"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "randomplum/gtkwave/gtkwave", args: ["HEAD"]
brew "rylan12/personal/evalcache", args: ["HEAD"]
brew "rylan12/personal/zsh-git-escape-magic", args: ["HEAD"]
brew "teamookla/speedtest/speedtest"
cask "arduino-ide"
cask "audio-hijack"
cask "balenaetcher"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "font-monaspace"
cask "fork"
cask "git-credential-manager-core"
cask "gitbutler"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "ltspice"
cask "macdown"
cask "mactex"
cask "notion"
cask "onyx"
cask "orka"
cask "private-internet-access"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
cask "zotero"
vscode "davidanson.vscode-markdownlint"
vscode "editorconfig.editorconfig"
vscode "espressif.esp-idf-extension"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "lorankloeze.ruby-rubocop-revived"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
